#encoding: UTF-8

require 'colorize'
require_relative 'item'

BACKGROUNDS = ["Стражник","Кузнец","Разведчик","Купец","Проповедник","Лекарь","Задира"]
MORALE = ["Подавлен","В порядке","Воодушевлен"]
NAMES = ["Аба","Аббас","Абд аль-Узза","Абдуллах","Абид","Аботур","Аввакум","Август","Авдей","Авель","Авигдор","Авирмэд","Авксентий","Авл","Авнер","Аврелий","Автандил","Автоном","Агапит","Агафангел","Агафодор","Агафон","Аги","Агриппа","Адам","Адам","Адар","Адиль","Адольф","Адонирам","Адриан","Азамат","Азарий","Азат","Азиз","Азим","Айварс","Айдар","Айрат","Акакий","Аквилий","Акиф","Акоп","Аксель","Алан","Алан","Аланус","Алек","Александр","Алексей","Алемдар","Алик","Алим","Алипий","Алишер","Алмат","Алоиз","Алон","Альберик","Альберт","Альбин","Альваро","Альвиан","Альвизе","Альфонс","Альфред","Амадис","Амвросий","Амедей","Амин","Амир","Амр","Амфилохий","Анания","Анас","Анастасий","Анатолий","Ангеляр","Андокид","Андрей","Андроник","Аннерс","Анри","Ансельм","Антипа","Антон","Антоний","Антонин","Антуан","Арам","Арефа","Арзуман","Аристарх","Аристон","Ариф","Аркадий","Арсений","Артём","Арфаксад","Атанасий","Атом","Аттик","Афанасий","Афинагор","Афиней","Афиф","Африкан","Ахилл","Ахмад","Ахтям","Ашот","Бадр","Барни","Бартоломео","Басир","Бахтияр","Безсон","Бен","Беньямин","Берт","Бехруз","Билял","Богдан","Болеслав","Бонавентура","Борис","Борислав","Боян","Бронислав","Брячислав","Бурхан","Бутрос","Бямбасурэн","Вадим","Валентин","Валерий","Валерьян","Вальдемар","Вангьял","Варлам","Варнава","Варфоломей","Василий","Вахтанг","Велвел","Венансио","Вениамин","Венцеслав","Викентий","Виктор","Викторин","Вильгельм","Винцас","Виссарион","Виталий","Витаутас","Вито","Владимир","Владислав","Владлен","Влас","Воислав","Володарь","Вольфганг","Вописк","Всеволод","Всеслав","Вук","Вукол","Вышеслав","Вячеслав","Габриеле","Гавриил","Гай","Галактион","Галымжан","Гамлет","Гарет","Гаспар","Гафур","Гвидо","Гейдар","Геласий","Гелий","Гельмут","Геннадий","Генри","Генрих","Георге","Георгий","Гераклид","Герберт","Герман","Германн","Геронтий","Герхард","Гийом","Гильем","Гинкмар","Глеб","Гней","Гоар","Горацио","Гордей","Градислав","Григорий","Гримоальд","Гуго","Гурий","Густав","Густав","Гьялцен","Давид","Дамдинсурэн","Дамир","Даниил","Дарий","Демид","Демьян","Денеш","Денис","Децим","Джаббар","Джамиль","Джан","Джанер","Джанфранко","Джафар","Джейкоб","Джихангир","Джованни","Джон","Джохар","Джулиано","Джулиус","Дино","Диодор","Дитер","Дитмар","Дитрих","Дмитрий","Доминик","Дональд","Донат","Дорофей","Досифей","Евгений","Евдоким","Еврит","Евсей","Евстафий","Евтихиан","Евтихий","Егор","Елеазар","Елисей","Емельян","Епифаний","Ербол","Ерванд","Еремей","Ермак","Ермолай","Ерофей","Ефим","Ефрем","Жан","Ждан","Жером","Жоан","Жюль","Захар","Захария","Збигнев","Зденек","Зейналабдин","Зенон","Зеэв","Зигмунд","Зинон","Зия","Золтан","Зосима","Иан","Ибрагим","Ибрахим","Иван","Игнатий","Игорь","Иероним","Иерофей","Израиль","Икрима","Иларий","Илия","Илларион","Ильфат","Илья","Имран","Иоаким","Иоанн","Иоанникий","Иоахим","Иов","Иоганн","Иоганнес","Ионафан","Иосафат","Ираклий","Иржи","Иринарх","Ириней","Иродион","Иса","Иса","Исаак","Исаакий","Исаия","Ислам","Исмаил","Истислав","Истома","Истукарий","Иулиан","Иштван","Йюрген","Кадваллон","Кадир","Казимир","Каликст","Калин","Каллистрат","Кальман","Канат","Карен","Карлос","Карп","Картерий","Кассиан","Кассий","Касторий","Катберт","Квинт","Кехлер","Киллиан","Ким","Кир","Кириак","Кирилл","Клаас","Клавдиан","Клеоник","Климент","Кондрат","Конон","Конрад","Константин","Корнелиус","Корнилий","Коррадо","Косьма","Кратет","Кратипп","Крис","Криспин","Кристиан","Кронид","Кузьма","Куприян","Курбан","Курт","Кутлуг-Буга","Кэлин","Лаврентий","Лаврентий","Лавс","Ладислав","Лазарь","Лайл","Лампрехт","Ландульф","Левенте","Леви","Лейсан","Ленни","Леонид","Леонтий","Леонхард","Лиам","Линкей","Логгин","Лоренц","Лоренцо","Луи","Луитпольд","Лука","Лукас","Лукий","Лукьян","Луций","Людовик","Люцифер","Макар","Максим","Максимиан","Максимилиан","Малик","Малх","Мамбет","Маний","Мануил","Мануэль","Мариан","Мариус","Марк","Маркел","Мартын","Марчелло","Матвей","Матео","Матиас","Матфей","Матфий","Махмуд","Меир","Мелентий","Мелитон","Менахем Мендель","Месроп","Мефодий","Мечислав","Мика","Микеланджело","Микулаш","Милорад","Мина","Мирко","Мирон","Мирослав","Митрофан","Михаил","Михей","Младан","Модест","Моисей","Мордехай","Мстислав","Мурад","Мухаммед","Мэдисон","Мэлс","Н","Назар","Наиль","Насиф","Натан","Натаниэль","Наум","Нафанаил","Нацагдорж","Нестор","Никандр","Никанор","Никита","Никифор","Никодим","Николай","Нил","Нильс","Ноа","Ной","Норд","Нуржан","О","Овадья","Оге","Одинец","Октав","Октавиан","Октавий","Октавио","Олаф","Оле","Олег","Оливер","Ольгерд","Онисим","Орест","Осип","Оскар","Осман","Отто","Оттон","Очирбат","Пабло","Павел","Павлин","Павсикакий","Паисий","Палладий","Панкратий","Пантелеймон","Папа","Паруйр","Парфений","Патрик","Пафнутий","Пахомий","Педро","Пётр","Пимен","Пинхас","Пипин","Питирим","Пол","Полидор","Полиевкт","Поликарп","Поликрат","Порфирий","Потап","Предраг","Премысл","Прокл","Прокул","Протасий","Прохор","Публий","Рагнар","Рагуил","Радмир","Радослав","Раймонд","Рамадан","Рамазан","Рахман","Рашад","Рейнхард","Ренат","Реститут","Ричард","Роберт","Родерик","Родион","Рожер","Розарио","Роман","Ромен","Рон","Ронан","Рудольф","Руслан","Руф","Руфин","Рушан","Сабит","Савва","Савватий","Савелий","Савин","Саддам","Садик","Саид","Салават","Салих","Саллюстий","Салман","Самуил","Сармат","Святослав","Севастьян","Северин","Секст","Секунд","Семён","Септимий","Серапион","Сергей","Серж","Сигеберт","Сильвестр","Симеон","Симон","Созон","Соломон","Сонам","Софрон","Спиридон","Срджан","Станислав","Степан","Стефано","Стивен","Таврион","Тавус","Тадеуш","Тарас","Тарасий","Теймураз","Тейс","Тендзин","Теофил","Терентий","Терри","Тиберий","Тигран","Тимофей","Тимур","Тихомир","Тихон","Тихон","Томас","Томоми","Торос","Тофик","Трифон","Тудхалия","Тутмос","Тьерри","Тьяго","Уве","Уильям","Улдис","Ульрих","Ульф","Умар","Урызмаг","Усама","Усман","Фавст","Фаддей","Фадлалла","Фарид","Фахраддин","Федериго","Фёдор","Федосей","Федот","Фейсал","Феликс","Феоктист","Феофан","Феофил","Феофилакт","Фердинанд","Ференц","Фидель","Филарет","Филип","Филипп","Философ","Филострат","Фирс","Фока","Фома","Фотий","Франц","Франческо","Фредерик","Фридрих","Фродо","Фульк","Хайме","Ханс","Харальд","Харитон","Хасан","Хетаг","Хильдерик","Хирам","Хлодвиг","Хокон","Хорив","Хоселито","Хосрой","Хрисанф","Христофор","Хуан","Цэрэндорж","Чеслав","Шалом","Шамиль","Шамсуддин","Шапур","Шарль","Шейх-Хайдар","Шон","Эберхард","Эдвард","Эдмунд","Эдна","Эдуард","Элбэгдорж","Элджернон","Элиас","Эллиот","Эмиль","Энрик","Энрико","Энтони","Эразм","Эрик","Эрнст","Эстебан","Этьен","Ювеналий","Юлиан","Юлий","Юлиус","Юрий","Юстас","Юстин","Яков","Якуб","Ян","Яни","Януарий","Яромир","Ярополк","Ярослав"]
class Person

  attr_accessor :name
  attr_accessor :background
  attr_accessor :hp
  attr_accessor :max_hp
  attr_accessor :healrate

  attr_accessor :body
  attr_accessor :spirit
  attr_accessor :mind

  attr_accessor :min_damage
  attr_accessor :max_damage
  attr_accessor :ac
  attr_accessor :initiative
  attr_accessor :morale

  attr_accessor :melee
  attr_accessor :ranged
  attr_accessor :speech
  attr_accessor :trading
  attr_accessor :traps
  attr_accessor :lockpick

  attr_accessor :gold
  attr_accessor :inventory
  attr_accessor :equiped

  attr_accessor :x
  attr_accessor :y




  def get_info
    puts "#{@background} #{@name}"

    puts "Тело: #{@body}, Дух: #{@spirit}, Разум: #{@mind}".blue
    puts
    puts "Ближний бой: #{@melee}"
    puts "Дальний бой: #{@ranged}"
    puts "Оратор: #{@speech}"
    puts "Продавец: #{@trading}"
    puts "Ловушки: #{@trap}"
    puts "Вскрытие замков: #{@lockpick}"
    puts
    puts "Очки жизни: #{@hp}/#{@max_hp}, Урон: #{@min_damage}-#{@max_damage}, Защита: #{@ac}".green
    puts "Скорость лечения: #{@healrate}, Инициатива: #{@initiative}, Мораль: #{MORALE[@morale]}".green
    puts
    puts "Money: #{@gold} coins".yellow
    puts
    puts "ЭКИПИРОВКА: ".red
    puts "Голова:      #{@equpied["Голова"]}"
    puts "Шея:         #{@equpied["Шея"]}"
    puts "Торс:        #{@equpied["Торс"]}"
    puts "Левая рука:  #{@equpied["Левая рука"]}"
    puts "Правая рука: #{@equpied["Правая рука"]}"
    puts "Ноги:        #{@equpied["Ноги"]}"
    puts
    puts "В инвентаре: #{@inventory}"

  end



  def initialize(complexity)
    @background = BACKGROUNDS[rand(BACKGROUNDS.size)]
    @name = NAMES[rand(NAMES.size)]

    @body = rand(10)+1
    @spirit = rand(10)+1
    @mind = rand(10)+1
    sum = @body+@spirit+@mind
    while sum!=5*complexity do
      @body = rand(10)+1
      @spirit = rand(10)+1
      @mind = rand(10)+1
      sum = @body+@spirit+@mind
    end
   @melee = (@body + @spirit/4).to_i
   @ranged = (@body + @mind/4).to_i
   @speech = (@mind + @spirit/4).to_i
   @trading = (@spirit + @mind/4).to_i
   @trap = (@mind + @body/4).to_i
   @lockpick = (@body + @mind)/4
   @gold = 11 + @trading + rand(@trading/2.to_i)
   @max_hp = 2*@body + @spirit/2.to_i
   @hp = @max_hp
   @ac = (@body+@spirit)/4.to_i
    @min_damage = 1
    @max_damage = @body/3.to_i + 1
    @healrate = (@body+@spirit)/2.to_i
    @morale = 1
    @initiative = @mind/3.to_i+1
    @equpied = Hash.new()
    @inventory = Array.new()
    @inventory = []
    @equpied["Голова"] = nil
    @equpied["Шея"] = nil
    @equpied["Торс"] = nil
    @equpied["Левая рука"] = nil
    @equpied["Правая рука"] = nil
    @equpied["Ноги"] = nil
  end
end
